Ran Plan for dir: `terraform/harbor/01-projects` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # harbor_project.my_project will be created
+ resource "harbor_project" "my_project" {
      + auto_sbom_generation        = false
      + enable_content_trust        = false
      + enable_content_trust_cosign = false
      + force_destroy               = false
      + id                          = (known after apply)
      + name                        = "my_project"
      + project_id                  = (known after apply)
      + public                      = false
      + registry_id                 = (known after apply)
      + storage_quota               = -1
      + vulnerability_scanning      = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/harbor/01-projects
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.nishiokatest.xyz/lock?id=nishioka-shinji%252Fmy_infra%252Fterraform%252Fharbor%252F01-projects%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/harbor/01-projects
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```